OpenFOAM-dev/tutorials/multiRegion/CHT/heatExchanger/system/air/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffles
    {
        type        faceZone;
        zoneName    rotorBlades;

        owner
        {
            name        blades;
            type        wall;
        }

        neighbour
        {
            name        blades;
        }
    }
}


// ************************************************************************* //
