OpenFOAM-dev/tutorials/multiRegion/CHT/heatExchanger/system/air/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // rotor faces
    {
        name    rotorCells;
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    cylinder;
    }
    {
        name    rotorFaces;
        type    faceSet;
        action  new;
        source  cellToFace;
        set     rotorCells;
        option  all;
    }
    {
        name    rotorFaces;
        type    faceSet;
        action  subset;
        source  boxToFace;
        box (-100 -100 0.1) (100 100 0.15);
    }

    {
        name    rotorBladesFaceSet;
        type    faceSet;
        action  new;
        source  faceToFace;
        set     rotorFaces;
    }

    {
        name    rotorBladesFaceSet;
        type    faceSet;
        action  subset;
        source  boxToFace;
        box (-100 0.249 -100) (100 0.251 100);
    }

    {
        name    rotorBlades2;
        type    faceSet;
        action  new;
        source  faceToFace;
        set     rotorFaces;
    }

    {
        name    rotorBlades2;
        type    faceSet;
        action  subset;
        source  boxToFace;
        box (0.249 -100 -100) (0.251 100 100);
    }

    {
        name    rotorBladesFaceSet;
        type    faceSet;
        action  add;
        source  faceToFace;
        set     rotorBlades2;
    }
    {
        name    rotorBlades;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet rotorBladesFaceSet;
    }
);


// ************************************************************************* //
